{
    "itemlist" :
    [
        {
            "src"       :   "Hvolsvollur-0824.jpeg",
            "caption"   :   "21st Birthday @ Skógafoss",
            "location"  :   "Hvolsvöllur, Iceland",
            "locationColor": "#800080",
            "date"      :   "Aug'24",
            "slug"      :   "hvolsvollur-0824",
            "genre"     :   "ICELAND | FAMILY TRAVEL | NATURE",
            "title"     :   "Celebrating 21 on the Land of Fire and Ice",
            "dates"     :   "08.23.24 ~ 08.28.24",
            "banner"    :   "iceland-0824-banner.jpeg",
            "blogPost"  : [
                {
                    "type"  : "paragraph",
                    "header": "Arrival: Into the Land of Fire and Ice",
                    "text"  : "After a quiet 3 a.m. taxi ride through the sleeping streets of Birmingham, we arrived at Keflavik International Airport, just in time to pick up our camper van. Buffeted by Iceland’s famous fierce winds, we brimmed with excitement, eager to begin our journey through the land of fire and ice. Fire greeted us first as we wound our way along Highway 41, glimpsing the smoldering earth at Grindavík, where volcanic remnants whispered ancient tales. Soon, we arrived at Hvammsvík, where steam rose like the earth’s breath. We sank into the warmth of the hot springs, cradled by towering mountains, as if the landscape itself had opened its arms to welcome us."
                },
                {
                    "type"  : "images-3",
                    "src1"  : "iceland-0824-11.jpeg",
                    "alt1"  : "Volcano erruption of Grindavík",
                    "src2"  : "iceland-0824-12.jpeg",
                    "alt2"  : "Hot spring of Hvammsvík",
                    "src3"  : "iceland-0824-13.jpeg",
                    "alt3"  : "Our Happer Camper van"
                },
                {
                    "type"  : "paragraph",
                    "header": "Snæfellsnes: Where Giants and Foxes Roam",
                    "text"  : "On our second day, we explored the wild beauty of the Snæfellsnes Peninsula. We visited the majestic Bárður Snæfellsás Statue, one of the peninsula’s most iconic attractions. This statue honors Bárður, a half-giant, half-human figure who fled Norway’s oppressive rule to seek freedom in Iceland. His journey symbolized a quest for independence and new beginnings. Later, during a brief stop for a bathroom break, we serendipitously encountered an Arctic fox—Iceland’s only native land mammal—roaming freely in the parking lot, a quiet reminder of this land's deep connection to nature. As we continued our tour, we marveled at Ströndin við Stapa og Hellna, where volcanic activity and coastal erosion sculpted the coastline. The cliffs, shaped by time and the elements, stood as a testament to Iceland’s awe-inspiring natural forces."
                },
                {
                    "type"  : "images-3",
                    "src1"  : "iceland-0824-21.jpeg",
                    "alt1"  : "The Arctic fox",
                    "src2"  : "iceland-0824-22.jpeg",
                    "alt2"  : "The Bárður Snæfellsás Statue",
                    "src3"  : "iceland-0824-23.jpeg",
                    "alt3"  : "Ströndin við Stapa og Hellna"
                },
                {
                    "type"  : "paragraph",
                    "header": "A Birthday Between Continents and Rainbows",
                    "text"  : "On the morning of my 21st birthday, we awoke to a new adventure. Our first stop was Thingvellir National Park, where the North American and Eurasian plates have slowly drifted apart, creating a rift over 40 meters wide in the past 9,000 years. Standing between two continents, I felt the immense weight of time and the quiet, steady movement of the earth beneath us. For lunch, we visited Friðheimar, an extraordinary greenhouse where geothermal energy and advanced technology make it possible to grow tomatoes year-round, despite Iceland’s harsh climate. In the afternoon, we drove southeast from Reykjavík to Rangárþing Eystra, where sunlight pierced the cascading waters, revealing a brilliant rainbow. Seeing this rainbow on my birthday—a symbol of God’s covenant to never flood the earth again—filled me with peace and gratitude. It was a powerful reminder of life’s enduring promises. Reflecting on both the physical journey through Iceland and the personal path that brought me here over 21 years, I felt a strong sense of anticipation for the future, knowing that each new chapter holds its own wonders waiting to be revealed."
                },
                {
                    "type"  : "images-3",
                    "src1"  : "iceland-0824-31.jpeg",
                    "alt1"  : "Þingvellir teconic plates",
                    "src2"  : "iceland-0824-32.jpeg",
                    "alt2"  : "Birthday lunch at Friðheimar",
                    "src3"  : "iceland-0824-33.jpeg",
                    "alt3"  : "Rainball waterfall at Rangárþing Eystra"
                },
                {
                    "type"  : "paragraph",
                    "header": "Vík: Puffins and Icebergs in a Fairytale Land",
                    "text"  : "On our fourth day, we journeyed to Vík í Mýrdal, the southernmost village in Iceland, home to just 640 residents. Vík felt like a place pulled from the pages of a fairytale, untouched by the world’s worries. As we strolled along Reynisfjara’s Black Sand Beach, we let our binoculars and camera capture the distant flutter of puffins. We watched as they danced above the waves, diving into the ocean’s depths before returning with beaks full of fish for their young. In the afternoon, we arrived at Jökulsárlón, Iceland’s largest and deepest glacial lagoon. Gliding through the lagoon on a boat ride, it felt like stepping into a scene from the Ice Age movie, with towering icebergs drifting lazily in the water. Watching the ice slowly melt stirred a longing for sustainability, a hope to preserve this beautiful landscape for future generations."
                },
                {
                    "type"  : "images-3",
                    "src1"  : "iceland-0824-41.jpeg",
                    "alt1"  : "The village of Vík",
                    "src2"  : "iceland-0824-42.jpeg",
                    "alt2"  : "Jökulsárlón glacial lagoon",
                    "src3"  : "iceland-0824-43.jpeg",
                    "alt3"  : "Puffins of Reynisfjara beach"
                },
                {
                    "type"  : "paragraph",
                    "header": "Glacier Journeys: The Sheep and the Ice",
                    "text"  : "On our fifth day, we were welcomed by the gentle gaze of an elderly Icelandic sheep, a rare close encounter with one of purest breeds of sheep. They often wander in groups of three—a mother ewe and her two lambs—toughened by centuries of surviving Iceland’s harsh farming conditions, their immune systems as resilient as the land itself. Following the encounter, we set off on a three-hour glacier hike to conquer the mighty Skaftafellsjökull, a sprawling tongue of ice extending from Vatnajökull, Europe’s largest glacier. With ice-clawed boots and spiked axes in hand, we made our way across the ancient ice, each step echoing the spirit of adventure. Upon reaching the top, we celebrated by drinking from the glacier’s pure, icy stream, a refreshing reward before making our way back to Reykjavík."
                },
                {
                    "type"  : "images-3",
                    "src1"  : "iceland-0824-51.jpeg",
                    "alt1"  : "An elderly Icelandic sheep",
                    "src2"  : "iceland-0824-52.jpeg",
                    "alt2"  : "Skaftafellsjökull glacier hike",
                    "src3"  : "iceland-0824-53.jpeg",
                    "alt3"  : "Sipping the glacier stream"
                },
                {
                    "type"  : "paragraph",
                    "header": "Reykjavík: Echoes of Heroes and the Finale",
                    "text"  : "On our sixth and final day in Iceland, we explored the heart of Reykjavík. Our first stop was the famed Bæjarins Beztu Pylsur, known for serving “The Town’s Best Hot Dogs”—a place so famous even Bill Clinton once stopped by. Next, we visited the towering statue of Leif Erikson, the first European to set foot on North American soil long before Columbus. His journey resonated with us as we later toured the Saga Museum, where Iceland’s folklore and history came to life through stories of ancient heroes and mythical beings. As our adventure came to a close, we reluctantly returned our camper van, packed with memories, and headed to the airport for our flight back to Chicago, leaving behind Iceland’s windswept beauty but taking its spirit with us."
                },
                {
                    "type"  : "images-3",
                    "src1"  : "iceland-0824-61.jpeg",
                    "alt1"  : "Bæjarins Beztu Pylsur hot dog stand",
                    "src2"  : "iceland-0824-62.jpeg",
                    "alt2"  : "Leif Erikson statue",
                    "src3"  : "iceland-0824-63.jpeg",
                    "alt3"  : "The Saga Museum"
                },
                {
                    "type"  : "paragraph",
                    "header": "Until next time, Iceland: A Land Etched in Memory",
                    "text"  : "As we boarded our flight back to Chicago, the memories of Iceland clung to me, each moment of our journey etched deeply into my heart—the raw force of glaciers, the quiet resilience of puffins and sheep, and the ancient history and mythology woven into the land. Tucked in my luggage was the biggest piece of solidified magma, a souvenir to remind me of this land forged by fire and shaped by ice. Six days of wonder had only revealed half of Iceland’s secrets, and though “Visiting Iceland” is technically crossed off my bucket list, I’ve decided to leave it there—waiting for the day I return to uncover the other half of its wonders."
                },
                {
                    "type"  : "images-3",
                    "src1"  : "iceland-0824-71.jpeg",
                    "alt1"  : "My magma souvenir",
                    "src2"  : "iceland-0824-72.jpeg",
                    "alt2"  : "The timeless fairytale of Iceland",
                    "src3"  : "iceland-0824-73.jpeg",
                    "alt3"  : "Until next time, Iceland!"
                }
            ]
        },
        
        {
            "src"       :   "london-0824.jpeg",
            "caption"   :   "\"Hey, Big Ben!\"",
            "location"  :   "London, the UK",
            "locationColor": "#800080",
            "date"      :   "Aug'24",
            "slug"      :   "the-uk-0824",
            "blogPost"  : []
        },

        {
            "src"       :   "baseball-0724.jpg",
            "caption"   :   "Middle School Reunion at my First Royals Game! - I Caught my First Ball!",
            "location"  :   "Guarenteed Rate Field",
            "locationColor": "#EE0943",
            "date"      :   "Jul'24",
            "slug"      :   "baseball-0724",
            "blogPost"  : []
        },

        {
            "src"       :   "broadway-0724.jpg",
            "caption"   :   "Genie-us! It's a Whole New World!",
            "location"  :   "Broadway, New York",
            "locationColor": "#EE0943",
            "date"      :   "Jul'24",
            "slug"      :   "broadway-0724",
            "blogPost"  : []
        },

        {
            "src"       :   "skydive-0324.jpg",
            "caption"   :   "Blue Skys Above, Red Rocks Below. Who Needs Scenic Biewpoints When You’ve Got Chutes to Shoot?",
            "location"  :   "Moab, Utah",
            "locationColor": "#008000",
            "date"      :   "Mar'24",
            "slug"      :   "skydive-0324",
            "blogPost"  : []
        },

        {
            "src"       :   "canyonland-0324.jpg",
            "caption"   :   "Just Meandering Through the Thick of the Canyons and the Thin of the Arches!",
            "location"  :   "Arches & Canyonland National Park",
            "locationColor": "#008000",
            "date"      :   "Mar'24",
            "slug"      :   "canyonland-0324",
            "blogPost"  : []
        },
        
        {
            "src"       :   "durrës-1223.jpeg",
            "caption"   :   "My First Global Mission Trip",
            "location"  :   "Durrës, Albania",
            "locationColor": "#800080",
            "date"      :   "Dec'23",
            "slug"      :   "albania-1223",
            "blogPost"  : []
        },

        {
            "src"       :   "taichung-0823.jpg",
            "caption"   :   "Food, Fun, and the Fam!",
            "location"  :   "Taichung, Taiwan",
            "locationColor": "#800080",
            "date"      :   "Aug'23",
            "slug"      :   "taichung-0823",
            "blogPost"  : []
        },

        {
            "src"       :   "ohtani-0523.jpg",
            "caption"   :   "Seeing my Two-Way Inspiration in Person!",
            "location"  :   "Guarenteed Rate Field",
            "locationColor": "#EE0943",
            "date"      :   "May'23",
            "slug"      :   "devils-lake-0523",
            "blogPost"  : []
        },

        {
            "src"       :   "devils-lake-0523.jpg",
            "caption"   :   "Came for the Views, but the Devil’s in the Details!",
            "location"  :   "Devil's Lake State Park, Wisconsin",
            "locationColor": "#008000",
            "date"      :   "May'23",
            "slug"      :   "devils-lake-0523",
            "blogPost"  : []
        },
        
        {
            "src"       :   "budapest-0323.jpeg",
            "caption"   :   "The Continental Europe Pioneer",
            "location"  :   "Budapest, Hungary",
            "locationColor": "#800080",
            "date"      :   "Mar'23",
            "slug"      :   "hungary-0323",
            "blogPost"  : []
        },

        {
            "src"       :   "bratislava-0323.jpeg",
            "caption"   :   "Eubrontes the Skovak Tyrant",
            "location"  :   "Bratislava, Slovakia",
            "locationColor": "#800080",
            "date"      :   "Mar'23",
            "slug"      :   "slovakia-0323",
            "blogPost"  : []
        },

        {
            "src"       :   "vienna-0323.jpeg",
            "caption"   :   "The paradise of the Danube",
            "location"  :   "Vienna, Austria",
            "locationColor": "#800080",
            "date"      :   "Mar'23",
            "slug"      :   "austria-0323",
            "blogPost"  : []
        },

        {
            "src"       :   "prague-0323.jpeg",
            "caption"   :   "The John Lennon Inspiration",
            "location"  :   "Prague, Czech Republic",
            "locationColor": "#800080",
            "date"      :   "Mar'23",
            "slug"      :   "prague-0323",
            "blogPost"  : []
        },

        {
            "src"       :   "guadalajara-0822.jpg",
            "caption"   :   "Mural of the Story: Always Have Tequila",
            "location"  :   "Guadalajara, Mexico",
            "locationColor": "#800080",
            "date"      :   "Aug'22",
            "slug"      :   "guadalajara-0822",
            "blogPost"  : []
        },

        {
            "src"       :   "yellowstone-0821.jpg",
            "caption"   :   "It’s Un-bull-ievable, I got Buffa-blown Away",
            "location"  :   "YellowStone & Grand Teton National Park",
            "locationColor": "#008000",
            "date"      :   "Aug'21",
            "slug"      :   "yellowstone-0821",
            "blogPost"  : []
        },

        {
            "src"       :   "zion-0321.jpg",
            "caption"   :   "In Zion National Park, Every View Is Heaven-Sent!",
            "location"  :   "Zion & Grand Canyon National Park",
            "locationColor": "#008000",
            "date"      :   "Mar'21",
            "slug"      :   "zion-0321",
            "blogPost"  : []
        },

        {
            "src"       :   "busan-1114.jpg",
            "caption"   :   "Thankfully, No Zombies On This Train To Busan!",
            "location"  :   "Busan, South Korea",
            "locationColor": "#800080",
            "date"      :   "Nov'14",
            "slug"      :   "busan-1114",
            "blogPost"  : []
        }
    ]
}