{
  "itemlist": [
    {
      "src": "post-image.png",
      "slug": "volatility-supersoldiers",
      "caption": "How Volatility Built Modern Supersoldiers",
      "caption_zh": "波動性如何造就現代超級戰士",
      "date": "Jul'25",
      "date_zh": "2025年7月",
      "genre": "Personal Growth | Risk | Psychology",
      "genre_zh": "個人成長｜風險｜心理學",
      "title": "How Volatility Built Modern Supersoldiers",
      "title_zh": "波動性如何造就現代超級戰士",
      "banner": "post-image.png",
      "blogPost": [
        {"type": "paragraph", "text": "Financial institutions commonly offer a spectrum of investment strategies designed to match individuals' varying risk tolerances across different life stages. At one end are aggressive strategies that promise higher expected returns but carry greater risks. At the other are conservative plans that prioritize capital preservation and stable growth.", "text_zh": "金融機構通常會根據個人不同人生階段的風險承受能力，提供一系列投資策略。激進型策略承諾更高的預期回報，但風險也更大；而保守型方案則強調資本保值與穩健成長。"},
        {"type": "paragraph", "text": "Conventionally, risk and reward are presented as two sides of a tradeoff. Yet in practice, this relationship can be asymmetrical. Under certain conditions, increased exposure to volatility can yield disproportionately greater long-term benefits.", "text_zh": "傳統上，風險與報酬被視為一體兩面的權衡。然而在實務上，這種關係有時並不對稱。在特定條件下，承擔更高波動性反而能帶來超乎比例的長期效益。"},
        {"type": "paragraph", "text": "Figures 1 and 2 illustrate the performance trajectories of two such strategies. Strategy 1 exhibits higher volatility with wider fluctuations in outcomes, while Strategy 2 demonstrates a smoother, more predictable return pattern.", "text_zh": "圖一與圖二展示了兩種策略的績效軌跡。策略一波動較大，結果起伏明顯；策略二則表現較為平穩、可預測。"},
        {"type": "images-2", "src1": "figure1.png", "alt1": "Figure 1: Strategy 1 performance trajectory", "alt1_zh": "圖一：策略一績效軌跡", "src2": "figure2.png", "alt2": "Figure 2: Strategy 2 performance trajectory", "alt2_zh": "圖二：策略二績效軌跡"},
        {"type": "paragraph", "text": "Now, if we extend this analogy to life itself, a central question emerges:", "text_zh": "如果我們將這個比喻延伸到人生本身，一個核心問題浮現："},
        {"type": "paragraph", "text": "If life were an investment, which strategy would you adopt?", "text_zh": "如果人生是一項投資，你會選擇哪種策略？", "className": "philosophy-paragraph philosophy-bold"},
        {"type": "paragraph", "text": "From a psychological standpoint, us humans exhibit loss aversion—the phenomenon where we feel losses more intensely than equivalent gains. This cognitive bias makes the stable path of Strategy 2 particularly attractive, as it minimizes perceived downside and emotional discomfort.", "text_zh": "從心理學角度來看，人類普遍有損失趨避傾向——我們對損失的感受遠比同等收益來得強烈。這種認知偏誤使得策略二的穩定路徑格外有吸引力，因為它能減少下行風險與情緒不適。"},
        {"type": "paragraph", "text": "However, psychological literature and lived experience also highlight that personal growth is most pronounced during periods of challenge and discomfort. Events such as failure, rejection, and emotional loss often serve as pivotal moments for self-discovery and development.", "text_zh": "然而，心理學文獻與生活經驗也指出，個人成長往往發生在挑戰與不適之中。失敗、挫折、情感失落等事件，常常成為自我發現與成長的關鍵時刻。"},
        {"type": "paragraph", "text": "Now consider a reframing of the output axis—not in terms of returns or happiness, but in terms of growth. The two strategies are transformed:", "text_zh": "現在，讓我們將橫軸重新定義，不再是回報或快樂，而是成長。這時兩種策略的意義也隨之轉變："},
        {"type": "images-2", "src1": "figure3.png", "alt1": "Figure 3: Strategy 1 growth trajectory", "alt1_zh": "圖三：策略一成長軌跡", "src2": "figure4.png", "alt2": "Figure 4: Strategy 2 growth trajectory", "alt2_zh": "圖四：策略二成長軌跡"},
        {"type": "paragraph", "text": "Now, we can see that the riskier strategy 1 not only offers higher upside than strategy 2, it also offers better growth opportunities when risks are taken at a controlled level.", "text_zh": "此時我們會發現，風險較高的策略一不僅有更高的上行空間，也在可控風險下帶來更多成長機會。"},
        {"type": "paragraph", "text": "Under this new projection, strategy 1 not only offers higher upside than strategy 2, it also offers better growth opportunities when risks are taken at a controlled level. The key, of course, is that the risk is undertaken within the boundary to not jeopardize survivorship. As the well-known aphorism goes: 'What doesn’t kill you makes you stronger.'", "text_zh": "在這個新視角下，策略一不僅有更高的潛在回報，也能在風險可控時帶來更好的成長。關鍵在於風險必須在不危及生存的範圍內。正如那句名言：『殺不死你的，會讓你更強大。』"},
        {"type": "paragraph", "text": "This idea echoes in many places. Another famous quote says, it's better to have loved and lost than never to have loved at all, suggesting that experiencing love, even with chances of heartbreak, is more fulfilling than avoiding love altogether to prevent potential heartbreak.", "text_zh": "這個觀念在許多地方都有呼應。另一句名言說：『寧可愛過而失去，也不要從未愛過。』這意味著，即使有心碎的風險，去愛與被愛的經歷仍比為了避免傷害而拒絕愛情來得更有意義。"},
        {"type": "paragraph", "text": "Young adults, in particular, possess a powerful asset: time. With fewer long-term obligations—such as mortgages, dependent families, or irreversible commitments—there exists a window of opportunity to take calculated risks, experiment with different paths, and learn through iteration. The cost of failure is lower, and the value of learning is higher.", "text_zh": "年輕人尤其擁有一項寶貴資產：時間。由於長期責任較少——如房貸、家庭或不可逆的承諾——因此有機會在可承受範圍內嘗試不同路徑、承擔風險並從中學習。失敗的代價較低，學習的價值則更高。"},
        {"type": "paragraph", "text": "So don’t be afraid of setbacks. Don’t let the fear of volatility steer you toward a life of playing small.", "text_zh": "所以，不要害怕挫折。不要讓對波動的恐懼限制你的人生格局。"},
        {"type": "paragraph", "text": "Bet on yourself. Invest in yourself. Believe in yourself.", "text_zh": "相信自己，投資自己，勇敢做自己。"},
        {"type": "paragraph", "text": "Because sometimes, the riskier strategy isn’t just about returns—it’s about becoming the person who can weather storms and still rise higher than you ever imagined.", "text_zh": "因為有時候，選擇更冒險的策略不只是為了回報，更是為了成為那個能夠經歷風雨、依然昂首前行的自己。"}
      ]
    },
    {
      "src": "thermo-running.jpg",
      "slug": "thermo-running",
      "caption": "How a Thermodynamics Equation Sparked My Love for Running",
      "caption_zh": "熱力學方程式如何點燃我對跑步的熱愛",
      "date": "Jun'25",
      "date_zh": "2025年6月",
      "genre": "Personal Growth | Thermodynamics | Running",
      "genre_zh": "個人成長｜熱力學｜跑步",
      "title": "How a Thermodynamics Equation Sparked My Love for Running",
      "title_zh": "熱力學方程式如何點燃我對跑步的熱愛",
      "banner": "thermo-running.jpg",
      "blogPost": [
        {
          "type": "paragraph",
          "text": "I’ve always been a little behind—at least on the track. Having my birthday in late August, I was usually the youngest in my class, and it showed on my elementary school sports days. The older kids ran faster, jumped higher, and made it look all too easy. Nothing scared me more than the running portion of the physical examination in Taiwan, where persisting through the 1.6km grill in one go always felt like mission impossible.",
          "text_zh": "我一直都跑得比較慢——至少在操場上是這樣。由於我是八月底出生，通常是班上年紀最小的，這在小學運動會時特別明顯。年紀大的同學跑得更快、跳得更高，一切都顯得輕而易舉。最讓我害怕的就是台灣體育測驗的跑步項目，要一口氣跑完1.6公里，對我來說總像是不可能的任務。"
        },
        {
          "type": "paragraph",
          "text": "Naturally, I leaned into what I was good at—school. I immersed  myself into my love for learning, and physical challenges faded quietly into the background.",
          "text_zh": "於是我選擇專注於自己擅長的事——讀書。我全心投入學習，體能上的挑戰也就悄悄地淡出了我的生活。"
        },
        {
          "type": "paragraph",
          "text": "That is, until college—when chemical engineering unexpectedly brought athletics back into view.",
          "text_zh": "直到上了大學——化工系意外地讓運動重新進入我的視野。"
        },
        {
          "type": "paragraph",
          "text": "In one of my thermodynamics lectures, we covered the general steady-state balance equation for any conserved quantity:",
          "text_zh": "在一次熱力學課堂上，老師介紹了任何守恆量的穩態平衡方程式："
        },
        {
          "type": "paragraph",
          "text": "Accumulation = Input – Output + Generation – Consumption",
          "text_zh": "累積量 = 輸入 – 輸出 + 產生 – 消耗",
          "className": "philosophy-equation"
        },
        {
          "type": "paragraph",
          "text": "At steady state, the accumulation term drops to zero:",
          "text_zh": "在穩態下，累積量這一項會變成零："
        },
        {
          "type": "paragraph",
          "text": "0 = Input – Output + Generation – Consumption",
          "text_zh": "0 = 輸入 – 輸出 + 產生 – 消耗",
          "className": "philosophy-equation"
        },
        {
          "type": "paragraph",
          "text": "Something clicked!",
          "text_zh": "我突然開竅了！"
        },
        {
          "type": "paragraph",
          "text": "I realized that when we sprint, our bodies rely heavily on anaerobic glycolysis, which rapidly produces lactate to meet the intense energy demand. But the lactate builds up faster than our systems can break it down. That burning sensation in our muscles? It’s our body’s signal that the system is overloaded. Eventually, we’re forced to slow down. (The same logic applies to glycogen or blood glucose too! Fascinating!)",
          "text_zh": "我意識到，當我們衝刺時，身體主要依賴無氧糖解作用來快速產生乳酸以應付劇烈的能量需求。但乳酸的產生速度遠遠超過身體分解它的速度。肌肉裡那種灼熱的感覺？其實是身體在告訴我們系統已經超載。最終，我們不得不放慢腳步。（同樣的道理也適用於肝醣或血糖！太有趣了！）"
        },
        {
          "type": "paragraph",
          "text": "However, if we run at a pace where lactate is generated and cleared at roughly the same rate just under the threshold where fatigue begins to accumulate, I hypothesized that a sustainable run, free from forced slowdown, might no longer be mission impossible.",
          "text_zh": "但如果我們用一種速度跑步，讓乳酸的產生和清除大致達到平衡、剛好低於疲勞開始累積的臨界點，我推測這樣的跑步就能持續下去，不再是那個不可能的任務。"
        },
        {
          "type": "paragraph",
          "text": "As a life engineer, I was stoked to test the idea!",
          "text_zh": "作為一個生活工程師，我迫不及待想要驗證這個想法！"
        },
        {
          "type": "paragraph",
          "text": "One morning, instead of grabbing my tennis shoes and heading to the library, I laced up my running sneakers and jogged toward the lakeshore. I didn’t set a goal—I just ran, focusing on maintaining a smooth, steady rhythm. An hour later, my Google Calendar buzzed to remind me I had class. I glanced down at my watch—7 kilometers! 7 kilometers! And I still felt like I could keep going!",
          "text_zh": "有一天早上，我沒有像往常一樣拿起網球鞋去圖書館，而是穿上跑鞋，朝湖邊慢跑過去。我沒有設定目標——只是專注於保持平穩的節奏。過了一小時，Google 行事曆提醒我該上課了。我低頭一看手錶——7公里！7公里！而且我還覺得自己可以繼續跑下去！"
        },
        {
          "type": "paragraph",
          "text": "Ecstatic about the breakthrough, I told my friend Stephen. Two months later, we crossed the finish line of our first 5K together.",
          "text_zh": "我興奮地把這個突破告訴了朋友 Stephen。兩個月後，我們一起完成了人生第一場 5K 跑步。"
        },
        {
          "type": "paragraph",
          "text": "That steady-state mindset stayed with me. During my internships in downtown Chicago, I fell in love with jogging along the lakefront trail. All thanks to one thermodynamics lecture, I couldn’t be more excited adding The Chicago Marathon to my bucket list!",
          "text_zh": "這種穩態思維一直陪伴著我。實習期間，我愛上了芝加哥湖濱步道的慢跑。全都要感謝那堂熱力學課，現在我已經迫不及待要把芝加哥馬拉松加入我的人生清單！"
        }
      ]
    }
  ]
} 